packages/eessi-testsuite/eessi_testsuite-0.8.0.tar.gz/eessi_testsuite-0.8.0/eessi/testsuite/tests/apps/openfoam/src/cavity3D/1M/fixedIter/Allpre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar
runParallel renumberMesh -overwrite

#------------------------------------------------------------------------------
